Snippets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>YASnippets</title>
<!-- 2016-08-29 Mon 23:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/style.css" rel="stylesheet"></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index"> HOME </a>
</div><div id="content">
<h1 class="title">YASnippets</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. This is not the file you are looking for&#x2026;</a></li>
<li><a href="#sec-2">2. Building&#xa0;&#xa0;&#xa0;<span class="tag"><span class="build">build</span></span></a>
<ul>
<li><a href="#sec-2-1">2.1. Execute this during development</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Text modes</a>
<ul>
<li><a href="#sec-3-1">3.1. Org&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Source blocks.  A majority of mine are elisp and snippets</a></li>
<li><a href="#sec-3-1-2">3.1.2. So meta! Such Wow!</a></li>
<li><a href="#sec-3-1-3">3.1.3. David Allen's Natural Project Planning model.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Programming modes</a>
<ul>
<li><a href="#sec-4-1">4.1. Javascript</a></li>
<li><a href="#sec-4-2">4.2. Coffeescript</a></li>
<li><a href="#sec-4-3">4.3. Lisp</a></li>
<li><a href="#sec-4-4">4.4. Ruby</a></li>
<li><a href="#sec-4-5">4.5. SQL</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> This is not the file you are looking for&#x2026;</h2>
<div class="outline-text-2" id="text-1">
<p>
If you want to configure yasnippets for the emagicians starter kit, you want to go into the "editing" section.  This file is actually for <b>generating</b> the snippets.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Building&#xa0;&#xa0;&#xa0;<span class="tag"><span class="build">build</span></span></h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets"</span>)
(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets/js-mode"</span>)
(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets/coffeescript-mode"</span>)
(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets/org-mode"</span>)
(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets/emacs-lisp-mode"</span>)
(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets/ruby-mode"</span>)
(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets/emacs-lisp-mode"</span>)
(emagician/expect-dir<span class="org-unicode-whitespace-subdued-space"> </span><span class="org-string">"./assets/snippets/sql-mode"</span>)
</pre>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Execute this during development</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-function-name">emagician/snippet-tangle-and-reload</span><span class="org-unicode-whitespace-subdued-space"> </span>()<span class="org-unicode-whitespace-subdued-trailing"> </span>
<span class="org-unicode-whitespace-subdued-space">  </span><span class="org-doc">"Helper</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">function</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">to</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">automagickally</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">tangle</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">and</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">reload</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">snippets</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">after</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">the</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">snippet</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">file</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">is</span><span class="org-unicode-whitespace-subdued-space"> </span><span class="org-doc">saved"</span>
<span class="org-unicode-whitespace-subdued-space">  </span>(org-babel-tangle)
<span class="org-unicode-whitespace-subdued-space">  </span>(yas-reload-all))

(add-hook<span class="org-unicode-whitespace-subdued-space"> </span>'after-save-hook<span class="org-unicode-whitespace-subdued-space"> </span>'emagician/snippet-tangle-and-reload<span class="org-unicode-whitespace-subdued-space"> </span>t<span class="org-unicode-whitespace-subdued-space"> </span>t)
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Text modes</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Org&#xa0;&#xa0;&#xa0;<span class="tag"><span class="org">org</span></span></h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Source blocks.  A majority of mine are elisp and snippets</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-text"># name: source block
# key: src
# --
#+begin_src $1 $2
$0
#+end_src
</pre>
</div>

<div class="org-src-container">

<pre class="src src-text"># name: emacs-lisp
# key: lisp
# --
#+begin_src emacs-lisp $1
$0
#+end_src
</pre>
</div>

<div class="org-src-container">

<pre class="src src-text"># name: sh
# key: sh
# --
#+begin_src sh $1
$0
#+end_src
</pre>
</div>

<div class="org-src-container">

<pre class="src src-text"># name: sql
# key: sql
# --
#+begin_src sql $1
$0
#+end_src
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> So meta! Such Wow!</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-text"># name: yasnippet
# key: snippet
# --
#+begin_src yasnippet :tangle assets/snippets/$1/$2
# name: $2
# key: $2
#--
$0
#+end_src
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> David Allen's Natural Project Planning model.</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">

<pre class="src src-text"># name: project
# key: project
# --
** PROJECT $1
   - Purpose - 50K :: $2
   - Success Looks Like - 40K  :: $3
   - Brainstorming - 30K
     - $4
   - Organize the brainstorming and come up with next actions (20K) 
*** TODO $5
</pre>
</div>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Programming modes</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Javascript</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-yasnippet">text-mode
</pre>
</div>

<div class="org-src-container">

<pre class="src src-yasnippet"># name: function(...) { ... }
# key: function
# --
function(${1:args}) {
    $0
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-yasnippet"># name: var (declare)
# key: var
# --
var $0;
</pre>
</div>


<div class="org-src-container">

<pre class="src src-yasnippet"># name: var (assign)
# key: var
# --
var $1 = $0;
</pre>
</div>


<div class="org-src-container">

<pre class="src src-yasnippet"># name: var (assign)
# key: var
# --
describe("$1", function(done) {
        $0
});
</pre>
</div>

<div class="org-src-container">

<pre class="src src-yasnippet"># name: var (assign)
# key: var
# --
it("$1", function(done) {
        $0
});
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Coffeescript</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-yasnippet"># name: if
# key: if
# -- 
if $1
  $0
</pre>
</div>

<div class="org-src-container">

<pre class="src src-yasnippet"># name: if
# key: if
# -- 
if $1
  $2
else v$0
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Lisp</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-yasnippet"># name: defun
# key: defun
#--
(defun $1 ($2) 
  "$3"
  $0)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Ruby</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-yasnippet"># name: def
# key: def
# -- 
def $1 $2
  $0
end
</pre>
</div>

<div class="org-src-container">

<pre class="src src-yasnippet"># name: if
# key: if
# -- 
if ($1)
  $0
end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> SQL</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">

<pre class="src src-yasnippet"># name: select
# key: select
#--
select $1 from $2 as $3 ${4:left join $5 as $6 on $3.$7 = $6.${7:id} } where $8
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2016-08-29 Mon 23:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
